USE S_MyBase

INSERT into Workers (Surname, Name, Patronymic, Adress, Phone, Experience, ID)
	VALUES('Русак', 'Анатолий', 'Владимирович', 'Переходная 64', '(33)123-45-88', 10, 1),
		  ('Ларин', 'Богдан', 'Егорович', 'Бобруйская 25', '(25)757-05-18', 15, 2),
		  ('Лапин', 'Даниил', 'Максимович', 'Бобруйская 25', '(33)345-76-10', 9, 3),
		  ('Буров', 'Георгий', 'Артурович', 'Бобруйская 25', '(25)264-23-21', 20, 4),
		  ('Абрамов', 'Андрей', 'Викторович', 'Паршина 54', '(29)456-84-04', 30, 5),
		  ('Кудрявцев', 'Антон', 'Фёдорович', 'Паршина 54', '(25)040-32-12', 30, 6),
		  ('Прохоров', 'Даниил', 'Германович', 'Кнорина 30', '(33)456-77-90', 45, 7),
		  ('Юдин', 'Артемий', 'Владиславович', 'Бобруйская 25', '(25)345-56-27', 12, 8);
INSERT into Details_Operation (Name_Operation, Sign_Of_Complexity)
	VALUES('Герметизация', 2),
	      ('Дефектация', 2),
		  ('Нагревание', 2),
		  ('Нарезка', 1),
		  ('Охлаждение', 2),
		  ('Разметка', 1),
		  ('Смазывание', 1),
		  ('Травление', 3);
INSERT into Details (Name_Operation, Count, Worker, ID, Date)
	VALUES('Разметка', 100, 1, 1, convert(date, '2007-03-23', 102)),
		  ('Травление', 200, 2, 2, convert(date, '2007-01-11', 102)),
		  ('Герметизация', 130, 3, 3,convert(date, '2008-07-22', 102)),
		  ('Нарезка', 80, 4, 4, convert(date, '2008-07-22', 102)),
		  ('Смазывание', 300, 5, 5, convert(date, '2008-02-07', 102)),
		  ('Охлаждение', 200, 6, 7, convert(date, '2009-06-26', 102));
